Update programme-cpp.md
